import random

def speak():
    JB = ['在太陽升起來之前，本來就是最黑暗的時候', '努力有了回報的時候會感到幸福',
    '與其接受稱讚活成別人，不如活成自己接受罵名', '如果你有一個夢想，只要你努力，你的夢想就會實現，不要放棄', 
    'But I want it, so I got it. It is my body and my life, so I just did it.', '我們不可能一直的快樂和開心，但是我希望你們能在黑暗中找到光明',
    '不會放棄的，既然要放棄，那就不要開始；既然開始了，就會登上頂峰的', 'Since you have a dream, do not lost that dream.', 'Work hard, Play hard.', 'Be real,  stay true.', '磕到頭也沒關係，正好藉這個機會休息一下', '如果我們永不停下尋找我們所喜愛的事物的腳步，終有一天我們會找到它，然後實現它',
    '所謂的幸運不是那樣直接得到的，是得跟著努力一起才會擁有的東西', '即使經歷了人生中艱難的時刻，即使有人恨你，你也不必擔心，因為如果你能挺過去，最後總會出現光明的', '不用擔心自己的樣貌，你就是你自己',
    '想要一步登天很難，做事應該腳踏實地，也需要仔細和細心', '這個世界上沒有不辛苦的，但是你享受這個辛苦的話，你的世界會改變的','人生的一半是枷鎖，另一半是為了解開枷鎖而努力', 
    'Always be hungry in what you wanna do. Take risks, work hard, and no regrets.','雖然會有很多辛苦的事，但是啊明天會比今天更好的',
    '如果你有一個夢想，那麼你無論如何都應該絕不放棄；如果你不氣餒那麼你就會成功，這是我所相信的', '不要害怕有人討厭你，不需要嘗試去滿足討厭你的人，因為你無論做什麼，他們都不會喜歡你，謹記！做好自己就好',
    '如果一開始是順境，那我們也不可能拼盡全力', '車子跑著跑著也要加油對吧？不加油就不能跑了！手機也要充電了才能用。像這樣機器都需要休息的時間，更何況是我們人呢？不然身體也會罷工的。健康最重要，比起成功健康更重要', '過得很辛苦所以總是反復想“為什麼會這樣呢"，但是要從這個想法裡面出來，在困難中好好看看自己，然後要更愛自己，更關心自己',
    '經常有人說自己只是三天熱度，但是一直三天熱度的話，三天再三天，不就是一輩子了嗎？所以說不要放棄，懂得開始才是重要的；不要看低自己，要覺得自己是更有價值的人', '在平行時空下，過好我們各自的生活',
    '你覺得自己很渺小，但別人眼中的你比你自己想的要偉大得多', '放棄不是一件壞事。你可以放棄，重新開始，所以不要感到內疚。重新開始才是最重要的，所以不要批評自己。我希望你最珍惜你自己', 
    '因為我們也是人，所以有時候我們會跌倒，有時候我們會遇到困難。我不能保證我們不會摔倒，但我可以保證我們會站起來的', '比起能做某件事情但直接放棄了而後悔，做了自己最大努力仍然不行而放棄是給自己最好的答案',
    '我不太相信天生的可能性。即使一開始並不可能，通過自己的努力也一定可以取得成功', '一直只想著美好的事情吧，明天也會有好事的', '你需要更多地相信自己的能力，不要認為事情不會成功', '我覺得有夢想是好事，即使最後沒有實現但是你有為一件事去努力過，這是很好的',
    '即使有再多的困難情況都是可以克服的，能做喜歡的事情就好了；希望你一定不要放棄，絕對不要放棄','Just do it 儘管去做吧', 
    '想做的事就去做！還有，每當想做什麼就去做吧！比起制定目標，我今天要做這個的話就努力去做',
    '“明天要做這個！”“下次做啥呢？”下次，再下次會持續這麼想。因為制定目標去做的話可能會突然討厭做了。只是明天，立刻做的話，會一直覺得很有意思的話，繼續做這個就行了！',
    '心懷夢想的大家對於自己選擇的夢想，要擁有自信，絕對不能認為自己不行，我持續的只思考這一件事，進一步去研究它，相信自己真正的去努力的話，夢想就會真的照進現實', '我希望一切順利，像你希望的一樣；你可能會失敗，但你會從錯誤中學習. So you know just go for it, just take your time, relax, just let it be.',
    '每個人都請不要為我們而活，我希望你們也要照顧好自己', '只要做讓自己快樂的事情，沒有人能阻止你去體驗快樂',
    '我們會更加努力，然後成為你們的力量', 'Do not let anything stop you from being happy.', 'Live your life to the fullest.',
    '每個人都會犯錯的，不管你是誰，藝術家或偶像；我們也都是人，每個人都會犯錯，每個人都必須知道如何原諒彼此，愛是最強大的力量',
    '當我們犯錯的時候，首先我們會感到壓力，會感到沮喪，就像這個世界突然變成了一個沉悶的地方；但過後我們會很快回到現實，意識到為什麼一開始我們會感到很沮喪，這只是幫助我們成長的另一課', '如果你對它有熱情，你是好是壞並不重要，因為你有熱情。如果你做得好，結果可能是實現你的夢想', '因為喜歡而去做好像是最重要的','明天也要加油 我們要一起加油 明天也是新的一天！',
    '我永遠不會滿足於現狀，我會一直朝著更好的方向努力，我希望你們都能跟上我', '只有自己先愛惜自己，其他人才會來珍惜你愛你，不管是甚麼人', '真的發自真心的為你加油，雖然可能會有獨自一個人的時候，但是要記住我們永遠和你在一起，一定會為你加油的！',
    '我可以站在舞臺上盡情揮灑我的熱情的原因就是：我從未忘記我的初心','如果你的一天結束了，你今天做的很好，辛苦了！如果你的一天剛剛開始，懷挺！如果你的一天還在進行中，那就繼續努力！每個人都要有美好的一天～']

    name = ['林在範', '段宜恩', '王嘉爾', '朴珍榮', '崔榮宰', 'BamBam', '金有謙']
    """
    JB = ['在太陽升起來之前，本來就是最黑暗的時候', '努力有了回報的時候會感到幸福', 
    '與其接受稱讚活成別人,不如活成自己接受罵名', '如果你有一個夢想，只要你努力，你的夢想就會實現,不要放棄', 
    'But I want it, so I got it. It is my body and my life, so I just did it.', '我們不可能一直的快樂和開心，但是我希望你們能在黑暗中找到光明',
    '不會放棄的,既然要放棄,那就不要開始;既然開始了,就會登上頂峰的', 'Since you have a dream, do not lost that dream.']
    Mark = ['Work hard, Play hard,', 'Be real, stay true.', '磕到頭也沒關係，正好藉這個機會休息一下', '如果我們永不停下尋找我們所喜愛的事物的腳步 終有一天我們會找到它 然後實現它',
    '所謂的幸運不是那樣直接得到的，是得跟著努力一起才會擁有的東西', '即使經歷了人生中艱難的時刻，即使有人恨你，你也不必擔心，因為如果你能挺過去，最後總會出現光明的', '不用擔心自己的樣貌,你就是你自己',
    '想要一步登天很難 做事應該腳踏實地 也需要仔細和細心']
    Jackson = ['這個世界上沒有不辛苦的，但是你享受這個辛苦的話，你的世界會改變的','人生的一半是枷鎖，另一半是為了解開枷鎖而努力', 
    'Always be hungry in what you wanna do. Take risks, work hard, and no regrets.', '雖然會有很多辛苦的事，但是啊明天會比今天更好的',
    '如果你有一個夢想,那麼你無論如何都應該絕不放棄;如果你不氣餒那麼你就會成功,這是我所相信的', '不要害怕有人討厭你，不需要嘗試去滿足討厭你的人，因為你無論做什麼，他們都不會喜歡你,謹記！做好自己就好',
    '如果一開始是順境，那我們也不可能拼盡全力', '車子跑著跑著也要加油對吧？不加油就不能跑了!手機也要充電了才能用。像這樣機器都需要休息的時間，更何況是我們人呢？不然身體也會罷工的.健康最重要,比起成功健康更重要']
    Jinyoung = ['過得很辛苦所以總是反復想“為什麼會這樣呢"，但是要從這個想法裡面出來，在困難中好好看看自己，然後要更愛自己，更關心自己',
    '經常有人說自己只是三天熱度，但是一直三天熱度的話，三天再三天，不就是一輩子了嗎? 所以說不要放棄，懂得開始才是重要的;不要看低自己，要覺得自己是更有價值的人', '在平行時空下，過好我們各自的生活',
    '你覺得自己很渺小，但別人眼中的你比你自己想的要偉大得多', '放棄不是一件壞事。你可以放棄，重新開始，所以不要感到內疚。重新開始才是最重要的，所以不要批評自己。我希望你最珍惜你自己', 
    '因為我們也是人 所以有時候我們會跌倒 有時候我們會遇到困難 我不能保證我們不會摔倒 但我可以保證我們會站起來的', '比起能做某件事情但直接放棄了而後悔,做了自己最大努力仍然不行而放棄是給自己最好的答案',
    '我不太相信天生的可能性。即使一開始並不可能，通過自己的努力也一定可以取得成功']
    Youngjae = ['一直只想著美好的事情吧,明天也會有好事的', '你需要更多地相信自己的能力，不要認為事情不會成功', '對自己不要太過分 現在這樣就是最好的',
    '即使有再多的困難情況都是可以克服的,能做喜歡的事情就好了;希望你一定不要放棄,絕對不要放棄','Just do it 儘管去做吧', 
    '想做的事就去做！還有，每當想做什麼就去做吧！比起制定目標，我今天要做這個的話就努力去做.',
    '“明天要做這個！”“下次做啥呢？”下次，再下次會持續這麼想。因為制定目標去做的話可能會突然討厭做了。只是明天，立刻做的話，會一直覺得很有意思的話，繼續做這個就行了！',
    '心懷夢想的大家對於自己選擇的夢想，要擁有自信，絕對不能認為自己不行，我持續的只思考這一件事，進一步去研究它，相信自己真正的去努力的話，夢想就會真的照進現實']
    BamBam = ['我希望一切順利,像你希望的一樣;你可能會失敗,但你會從錯誤中學習. So you know just go for it, just take your time, relax, just let it be.',
    '每個人都請不要為我們而活,我希望你們也要照顧好自己', '只要做讓自己快樂的事情 沒有人能阻止你去體驗快樂',
    '我們會更加努力,然後成為你們的力量', 'Do not let anything stop you from being happy.', 'Live your life to the fullest.',
    '每個人都會犯錯的,不管你是誰,藝術家或偶像;我們也都是人,每個人都會犯錯,每個人都必須知道如何原諒彼此,愛是最強大的力量',
    '當我們犯錯的時候，首先我們會感到壓力,會感到沮喪，就像這個世界突然變成了一個沉悶的地方;但過後我們會很快回到現實，意識到為什麼一開始我們會感到很沮喪，這只是幫助我們成長的另一課']
    Yugyeom = ['如果你對它有熱情，你是好是壞並不重要，因為你有熱情。如果你做得好，結果可能是實現你的夢想', '因為喜歡而去做好像是最重要的','明天也要加油 我們要一起加油 明天也是新的一天',
    '我永遠不會滿足於現狀，我會一直朝著更好的方向努力，我希望你們都能跟上我', '只有自己先愛惜自己,其他人才會來珍惜你愛你,不管是甚麼人', '要尋找自己的色彩 要具備基本技能才能使自己的色彩更大放異彩',
    '我可以站在舞臺上盡情揮灑我的熱情的原因就是，我從未忘記我的初心','如果你的一天結束了,你今天做的很好,辛苦了!如果你的一天剛剛開始,懷挺!如果你的一天還在進行中,那就繼續努力!每個人都要有美好的一天~'] 
    """
    test = random.randint(0,55)

    return JB[test] + '--' + name[int(test / 8)]
    """test = random.randint(0,7)
    return Mark[test],'--段宜恩','\n')
    test = random.randint(0,7) 
    return Jackson[test],'--王嘉爾','\n')
    test = random.randint(0,7)
    return Jinyoung[test],'--朴珍榮','\n')
    test = random.randint(0,7)
    return Youngjae[test],'--崔榮宰','\n')
    test = random.randint(0,7)
    return BamBam[test],'--BamBam','\n')
    test = random.randint(0,7)
    return Yugyeom[test],'--金有謙','\n') """



